In [1]:
import pandas as pd

# Change Data Type for one or more columns in Pandas Dataframe

In [2]:
df = pd.DataFrame({
        'A': [1,2,3,4,5],
        'B': ['a', 'b', 'c', 'd', 'e'],
        'C': [1.1, '2.5', '1.3', 2, 5]
})

In [3]:
df.dtypes

A     int64
B    object
C    object
dtype: object

In [4]:
# converting all columns to string type
df = df.astype(str)
df.dtypes

A    object
B    object
C    object
dtype: object

__Method 1: Using DataFrame.astype()__

In [5]:
# using dictionary to convert specific columns
convert_dict = {'A': int, 'C': float}
df = df.astype(convert_dict)
df.dtypes

A      int64
B     object
C    float64
dtype: object

__Method 2: Using DataFrame.apply()__

In [6]:
df = pd.DataFrame({
        'A': [1,2,3,4,5],
        'B': ['a', 'b', 'c', 'd', 'e'],
        'C': [1.1, '2.5', '1.3', 2, 5]
})

In [7]:
df.dtypes

A     int64
B    object
C    object
dtype: object

In [8]:
# using apply method
df[['A', 'C']] = df[['A', 'C']].apply(pd.to_numeric)

In [9]:
df.dtypes

A      int64
B     object
C    float64
dtype: object

__Method 3: Using DataFrame.infer_objects()__

In [10]:
df = pd.DataFrame({
        'A': [1,2,3,4,5],
        'B': ['a', 'b', 'c', 'd', 'e'],
        'C': [1.1, 2.1, 3.0, 4.1, 5.1]
}, dtype=object)

In [11]:
df.dtypes

A    object
B    object
C    object
dtype: object

In [12]:
# C will be converted to float only when all the values of the column are float
# if any value is of other type then dtype will be object
df = df.infer_objects()
df.dtypes

A      int64
B     object
C    float64
dtype: object

# Rename columns in dataframe

In [13]:
rankings = {'test': ['India', 'South Africa', 'England', 'New Zealand', 'Australia'], 
            'odi': ['England', 'India', 'New Zealand', 'South Africa', 'Pakistan'], 
            't20': ['Pakistan', 'India', 'Australia', 'England', 'New Zealand']}

# Convert the dictionary into DataFrame
rankings_pd = pd.DataFrame(rankings)
rankings_pd

           test           odi          t20
0         India       England     Pakistan
1  South Africa         India        India
2       England   New Zealand    Australia
3   New Zealand  South Africa      England
4     Australia      Pakistan  New Zealand

__Renaming a single column__

In [14]:
rankings_pd.rename(columns={'test': 'TEST'}, inplace=True)

In [15]:
rankings_pd

           TEST           odi          t20
0         India       England     Pakistan
1  South Africa         India        India
2       England   New Zealand    Australia
3   New Zealand  South Africa      England
4     Australia      Pakistan  New Zealand

__Renaming multiple columns__

In [16]:
rankings_pd = pd.DataFrame(rankings)

In [17]:
rankings_pd.rename(columns={'test': 'TEST', 'odi': 'ODI', 't20': 'T-20'}, inplace=True)

In [18]:
rankings_pd

           TEST           ODI         T-20
0         India       England     Pakistan
1  South Africa         India        India
2       England   New Zealand    Australia
3   New Zealand  South Africa      England
4     Australia      Pakistan  New Zealand

__Method 2: By assigning a list of new column names__

In [19]:
rankings_pd = pd.DataFrame(rankings)

In [20]:
rankings_pd.columns

Index(['test', 'odi', 't20'], dtype='object')

In [21]:
rankings_pd.columns = ['TEST', 'ODI', 'TWENTY20']

In [22]:
rankings_pd.columns

Index(['TEST', 'ODI', 'TWENTY20'], dtype='object')

# Adding a row at top in pandas DataFrame

In [23]:
rankings_pd = pd.DataFrame(rankings)

In [24]:
rankings_pd

           test           odi          t20
0         India       England     Pakistan
1  South Africa         India        India
2       England   New Zealand    Australia
3   New Zealand  South Africa      England
4     Australia      Pakistan  New Zealand

__Adding row at the top of given datarame by concatenating the old dataframe with new one.__

In [25]:
# Passing index is very important
new_row_1 = pd.DataFrame({'test': 'Afghanistan', 'odi': 'SriLanka', 't20': 'Kenya'}, index=[0])

In [26]:
df = pd.concat([new_row_1, rankings_pd]).reset_index(drop=True)
df

           test           odi          t20
0   Afghanistan      SriLanka        Kenya
1         India       England     Pakistan
2  South Africa         India        India
3       England   New Zealand    Australia
4   New Zealand  South Africa      England
5     Australia      Pakistan  New Zealand

In [27]:
new_row_2 = pd.DataFrame({'test': 'Bangladesh', 'odi': 'NetherLand', 't20': 'Zimbabwe'}, index=[0])

In [28]:
df = pd.concat([new_row_2, df[:]]).reset_index(drop=True)
df

           test           odi          t20
0    Bangladesh    NetherLand     Zimbabwe
1   Afghanistan      SriLanka        Kenya
2         India       England     Pakistan
3  South Africa         India        India
4       England   New Zealand    Australia
5   New Zealand  South Africa      England
6     Australia      Pakistan  New Zealand

In [29]:
# Access a group of rows and columns by label(s) or a boolean array.
# https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.loc.html
df.loc[3:]

           test           odi          t20
3  South Africa         India        India
4       England   New Zealand    Australia
5   New Zealand  South Africa      England
6     Australia      Pakistan  New Zealand

In [30]:
# Purely integer-location based indexing for selection by position.
df.iloc[:3]

          test         odi       t20
0   Bangladesh  NetherLand  Zimbabwe
1  Afghanistan    SriLanka     Kenya
2        India     England  Pakistan

In [31]:
df.iloc[[4, 3, 0]]

           test          odi        t20
4       England  New Zealand  Australia
3  South Africa        India      India
0    Bangladesh   NetherLand   Zimbabwe

In [32]:
df.loc[[4]]

      test          odi        t20
4  England  New Zealand  Australia

In [33]:
df.loc[[False, False, True]]

    test      odi       t20
2  India  England  Pakistan

In [34]:
# Condition that returns boolean series
df.loc[df['odi'] == 'India']

           test    odi    t20
3  South Africa  India  India

In [35]:
# Callable that returns a boolean Series
df.loc[lambda df: df['test'] == 'India']

    test      odi       t20
2  India  England  Pakistan

In [36]:
# Set value for an entire row
df.loc[3] = 'England'

In [37]:
df

          test           odi          t20
0   Bangladesh    NetherLand     Zimbabwe
1  Afghanistan      SriLanka        Kenya
2        India       England     Pakistan
3      England       England      England
4      England   New Zealand    Australia
5  New Zealand  South Africa      England
6    Australia      Pakistan  New Zealand

In [38]:
# Set value for entire column
df.loc[:, 'odi'] = 'Australia'

In [39]:
df

          test        odi          t20
0   Bangladesh  Australia     Zimbabwe
1  Afghanistan  Australia        Kenya
2        India  Australia     Pakistan
3      England  Australia      England
4      England  Australia    Australia
5  New Zealand  Australia      England
6    Australia  Australia  New Zealand

In [40]:
df = pd.DataFrame({"A":[12, 4, 5, None, 1],
                   "B":[7, 2, 54, 3, None],
                   "C":[20, 16, 11, 3, 8], 
                   "D":[14, 3, None, 2, 6]})

In [41]:
df

      A     B   C     D
0  12.0   7.0  20  14.0
1   4.0   2.0  16   3.0
2   5.0  54.0  11   NaN
3   NaN   3.0   3   2.0
4   1.0   NaN   8   6.0

In [42]:
# Return the mean absolute deviation of the values for the requested axis
df.mad(axis=1, skipna=True)

0     3.750000
1     4.875000
2    20.444444
3     0.444444
4     2.666667
dtype: float64

In [43]:
df = pd.DataFrame({"A":[5, 3, 6, 4],
                   "B":[11, 2, 4, 3],
                   "C":[4, 3, 8, 5],
                   "D":[5, 4, 2, 8]})

In [44]:
# find the covariance
df.cov()

          A          B         C         D
A  1.666667   2.333333  2.333333 -1.500000
B  2.333333  16.666667 -1.000000  0.000000
C  2.333333  -1.000000  4.666667 -2.333333
D -1.500000   0.000000 -2.333333  6.250000

# Split a text column into two columns in Pandas DataFrame

__Method 1: Using Series.str.split() functions.__

In [45]:
df = pd.DataFrame({
    'Name': ['John Smith', 'Jonny Walker', 'Benny Thomas', 'Mark Waugh'],
    'Age': [25, 26, 27, 23]
})

In [46]:
df

           Name  Age
0    John Smith   25
1  Jonny Walker   26
2  Benny Thomas   27
3    Mark Waugh   23

In [47]:
df.Name.str.split(expand=True)

       0       1
0   John   Smith
1  Jonny  Walker
2  Benny  Thomas
3   Mark   Waugh

In [48]:
# Split Name column into First and Last column respectively and add it to the existing Dataframe
df[['First Name', 'Last Name']] = df.Name.str.split(expand=True)

In [49]:
df

           Name  Age First Name Last Name
0    John Smith   25       John     Smith
1  Jonny Walker   26      Jonny    Walker
2  Benny Thomas   27      Benny    Thomas
3    Mark Waugh   23       Mark     Waugh

In [50]:
# Use underscore as delimiter to split the column into two columns.
df = pd.DataFrame({
    'Name': ['John_Smith', 'Jonny_Walker', 'Benny_Thomas', 'Mark_Waugh'],
    'Age': [25, 26, 27, 23]
})

In [51]:
df[['First Name', 'Last Name']] = df.Name.str.split("_", expand=True)
df

           Name  Age First Name Last Name
0    John_Smith   25       John     Smith
1  Jonny_Walker   26      Jonny    Walker
2  Benny_Thomas   27      Benny    Thomas
3    Mark_Waugh   23       Mark     Waugh

In [52]:
# Use str.split(), tolist() function together.
df = pd.DataFrame({
    'Name': ['John_Smith', 'Jonny_Walker', 'Benny_Thomas', 'Mark_Waugh'],
    'Age': [25, 26, 27, 23]
})
df

           Name  Age
0    John_Smith   25
1  Jonny_Walker   26
2  Benny_Thomas   27
3    Mark_Waugh   23

In [53]:
pd.DataFrame(df.Name.str.split('_', 1).tolist(), columns=['First Name', 'Last Name'])

  First Name Last Name
0       John     Smith
1      Jonny    Walker
2      Benny    Thomas
3       Mark     Waugh

__Method 2 : Using apply() function__

In [54]:
df = pd.DataFrame({
    'Name': ['John_Smith', 'Jonny_Walker', 'Benny_Thomas', 'Mark_Waugh'],
    'Age': [25, 26, 27, 23]
})

In [55]:
df[['First Name', 'Last Name']] = df.Name.apply(lambda x: pd.Series(str(x).split('_')))

In [56]:
df

           Name  Age First Name Last Name
0    John_Smith   25       John     Smith
1  Jonny_Walker   26      Jonny    Walker
2  Benny_Thomas   27      Benny    Thomas
3    Mark_Waugh   23       Mark     Waugh

# Difference of two columns in Pandas dataframe

In [57]:
df = pd.DataFrame({
        'Name':['George','Andrea','micheal', 'maggie','Ravi','Xien','Jalpa'],
        'score1':[62,47,55,74,32,77,86],
        'score2':[45,78,44,89,66,49,72]
})

__Method 1: Using "-" operator__

In [58]:
df['Score Difference'] = df['score1'] - df['score2']
df

      Name  score1  score2  Score Difference
0   George      62      45                17
1   Andrea      47      78               -31
2  micheal      55      44                11
3   maggie      74      89               -15
4     Ravi      32      66               -34
5     Xien      77      49                28
6    Jalpa      86      72                14

__Method 2: Using sub() method of the dataframe__

In [59]:
df['Score_Diff'] = df['score1'].sub(df['score2'], axis=0) # axis 0 means rows
df

      Name  score1  score2  Score Difference  Score_Diff
0   George      62      45                17          17
1   Andrea      47      78               -31         -31
2  micheal      55      44                11          11
3   maggie      74      89               -15         -15
4     Ravi      32      66               -34         -34
5     Xien      77      49                28          28
6    Jalpa      86      72                14          14

# Dropping one or multiple columns in Pandas dataframe

__Method 1: Drop columns from the datafame using drop() method__

In [60]:
df2 = df.drop(['Score Difference', 'Score_Diff'], axis=1) # axis 1 means columns
df2

      Name  score1  score2
0   George      62      45
1   Andrea      47      78
2  micheal      55      44
3   maggie      74      89
4     Ravi      32      66
5     Xien      77      49
6    Jalpa      86      72

__Method 2: drop columns from dataframe using iloc[] and drop() method__

In [61]:
df3 = df.drop(df.iloc[:, 3:5], axis=1)
df3

      Name  score1  score2
0   George      62      45
1   Andrea      47      78
2  micheal      55      44
3   maggie      74      89
4     Ravi      32      66
5     Xien      77      49
6    Jalpa      86      72

In [62]:
df4 = df.drop(df.loc[:, 'Score Difference':'Score_Diff'].columns, axis=1) # with or without columns it works
df4

      Name  score1  score2
0   George      62      45
1   Andrea      47      78
2  micheal      55      44
3   maggie      74      89
4     Ravi      32      66
5     Xien      77      49
6    Jalpa      86      72

# Selecting random rows from pandas DataFrame

__Method 1: Using sample() method__

In [63]:
# Select one row randomaly using sample() without give any parameters 
df.sample()

     Name  score1  score2  Score Difference  Score_Diff
1  Andrea      47      78               -31         -31

In [64]:
# Using parameter n, which selects n numbers of rows randomly
df.sample(n=3)

     Name  score1  score2  Score Difference  Score_Diff
0  George      62      45                17          17
6   Jalpa      86      72                14          14
3  maggie      74      89               -15         -15

In [65]:
# Using frac parameter
df.sample(frac=0.5) # here you get .50 % of rows

     Name  score1  score2  Score Difference  Score_Diff
6   Jalpa      86      72                14          14
4    Ravi      32      66               -34         -34
0  George      62      45                17          17
3  maggie      74      89               -15         -15

In [66]:
# First selects 70 % and assign it to new dataframe and then get 50 % from the new dataframe
df_per = df.sample(frac=.7)
df_per.sample(frac=.5)

     Name  score1  score2  Score Difference  Score_Diff
1  Andrea      47      78               -31         -31
5    Xien      77      49                28          28

Select some rows randomly with replace = false
Parameter replace give permission to select one rows many time(like).
Default value of replace parameter of sample() method is Falseso you never select more than total number of rows.

In [67]:
# ValueError: Cannot take a larger sample than population when 'replace=False'
# df.sample(n=10, replace=False)

In [68]:
# replace True will not throw error if it is more than the number of rows in the data frame
# Rows will be repeated
df.sample(n=10, replace=True)

      Name  score1  score2  Score Difference  Score_Diff
0   George      62      45                17          17
0   George      62      45                17          17
0   George      62      45                17          17
0   George      62      45                17          17
6    Jalpa      86      72                14          14
4     Ravi      32      66               -34         -34
4     Ravi      32      66               -34         -34
4     Ravi      32      66               -34         -34
3   maggie      74      89               -15         -15
2  micheal      55      44                11          11

In [69]:
# Using weights
tweights = [0.2, 0.2, 0.2, 0.4, 0.3, 0.5, 0.6]
# ValueError: Weights and axis to be sampled must be of same length
df.sample(n=3, weights=tweights)

     Name  score1  score2  Score Difference  Score_Diff
5    Xien      77      49                28          28
3  maggie      74      89               -15         -15
6   Jalpa      86      72                14          14

In [70]:
# Using axis
df.sample(axis=0)

   Name  score1  score2  Score Difference  Score_Diff
5  Xien      77      49                28          28

In [71]:
# Using random_state
# With a given seed, the sample will always draw the same rows. If random_state is None or np.random, 
# then a randomly-initialized. RandomState object is returned. 
df.sample(n=3, random_state=2)

     Name  score1  score2  Score Difference  Score_Diff
4    Ravi      32      66               -34         -34
1  Andrea      47      78               -31         -31
3  maggie      74      89               -15         -15

__Method 2: Using Numpy__

In [72]:
import numpy as np

In [73]:
chosen_idx = np.random.choice(4, replace=True, size=6)
chosen_idx

array([0, 2, 0, 3, 1, 1])

In [74]:
df.iloc[chosen_idx]

      Name  score1  score2  Score Difference  Score_Diff
0   George      62      45                17          17
2  micheal      55      44                11          11
0   George      62      45                17          17
3   maggie      74      89               -15         -15
1   Andrea      47      78               -31         -31
1   Andrea      47      78               -31         -31